Tasks/ПроверитьГабаритныеЧертежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>ПроверитьГабаритныеЧертежи</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторКорректировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БылаКорректировка</Name>
					<Comment>0  данные не заполнены, 1 была, 2 не было</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГабаритныйЧертеж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайняяДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗамера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ИзменениеСтатусаГЧ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыездНаЗамер</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПриемкиГабаритныхЧертежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наблюдатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наблюдатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

InformationRegisters/ДанныеКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКомплекта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Интерфейс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Интерфейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОбъектыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОбъектыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВедущийКонструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнитьКартуПроектаДиз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнитьКартуПроектаКон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеДлительностиПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполненияДлительностиМонтажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовитьОзнакомительныйВыезд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверятьГабаритныеЧерчежи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительЗамера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗапускВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьКартуПроектаДиз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьКартуПроектаКон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Tasks/ПроверитьГабаритныеЧертежи/Ext/ObjectModule.bsl
Процедура ПриВыполнении(Отказ)
	
	ИзменитьСтатусГЧ = ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("ДокументСсылка.АктПриемкиГабаритныхЧертежей");
	ТД = ТекущаяДата();
	
	Если БылаКорректировка = 1 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК ИзделиеКомплект
		|ПОМЕСТИТЬ втКомплекты
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ВыполнитьКорректировкуИзделияКомплект КАК ВыполнитьКорректировкуИзделияКомплект
		|		ПО (ВыполнитьКорректировкуИзделияКомплект.ИзделиеКомплект = ИзделияКомплект.Ссылка)
		|			И (ВыполнитьКорректировкуИзделияКомплект.ЗадачаПроверкиГабаритногоЧертежа = &ЗадачаПроверкиГабаритногоЧертежа)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.ПроверитьГабаритныеЧертежи КАК ПроверитьГабаритныеЧертежи
		|		ПО ИзделияКомплект.ГабаритныйЧертеж = ПроверитьГабаритныеЧертежи.ГабаритныйЧертеж
		|ГДЕ
		|	ПроверитьГабаритныеЧертежи.Ссылка = &ЗадачаПроверкиГабаритногоЧертежа
		|	И ВыполнитьКорректировкуИзделияКомплект.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеКомплекта.Конструктор КАК Исполнитель,
		|	втКомплекты.ИзделиеКомплект КАК ИзделиеКомплект,
		|	втКомплекты.ИзделиеКомплект.Наименование КАК Наименование,
		|	втКомплекты.ИзделиеКомплект.Проект КАК Проект
		|ИЗ
		|	втКомплекты КАК втКомплекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
		|		ПО втКомплекты.ИзделиеКомплект = ДанныеКомплекта.Комплект";
		
		Запрос.УстановитьПараметр("ЗадачаПроверкиГабаритногоЧертежа", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать(); 
		
		Пока Выборка.Следующий() Цикл
			
			ЗадачаПроверки = Задачи.ВыполнитьКорректировкуИзделияКомплект.СоздатьЗадачу();
			ЗадачаПроверки.Дата 									= ТекущаяДата();
			ЗадачаПроверки.ЗадачаПроверкиГабаритногоЧертежа 		= Ссылка;
			ЗадачаПроверки.ИзделиеКомплект 							= Выборка.ИзделиеКомплект;
			ЗадачаПроверки.Исполнитель 								= Выборка.Исполнитель;
			ЗадачаПроверки.Наименование								= Выборка.Наименование + "Комплект.Проверить";	
			ЗадачаПроверки.Проект									= Выборка.Проект;	
			ЗадачаПроверки.КрайняяДатаИсполнения					= ЗадачаПроверки.Дата + 7 * 24 * 3600;	
			
			ЗадачаПроверки.Записать();
			
		КонецЦикла; 
		
		
	ИначеЕсли БылаКорректировка = 3 Тогда
		
		ИсполнительЗадачи 	= Справочники.Пользователи.ПустаяСсылка();
		Наименование 	= "";
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПроверитьГабаритныеЧертежи.Основание.Автор КАК Исполнитель,
			|	ПроверитьГабаритныеЧертежи.ГабаритныйЧертеж.Наименование КАК ГабаритныйЧертежНаименование
			|ИЗ
			|	Задача.ПроверитьГабаритныеЧертежи КАК ПроверитьГабаритныеЧертежи
			|ГДЕ
			|	ПроверитьГабаритныеЧертежи.Ссылка = &Ссылка";
			
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ИсполнительЗадачи 	= Выборка.Исполнитель;
			Наименование 		= Выборка.ГабаритныйЧертежНаименование;
		КонецЦикла;
		
		ИзменитьСтатусГЧ = Ложь;
		
		ЗадачаПроверки = Задачи.НетДанныхДляИзмененияСтатусаГЧ.СоздатьЗадачу();
		ЗадачаПроверки.Дата 									= ТД;
		ЗадачаПроверки.ЗадачаПроверкиГабаритногоЧертежа 		= Ссылка;
		ЗадачаПроверки.ГабаритныйЧертеж 						= ГабаритныйЧертеж;
		ЗадачаПроверки.Исполнитель 								= ИсполнительЗадачи;
		ЗадачаПроверки.Наименование								= Выборка.ГабаритныйЧертежНаименование + ".Перезамер";	
		ЗадачаПроверки.Проект									= Проект;	
		ЗадачаПроверки.КрайняяДатаИсполнения					= ЗадачаПроверки.Дата + 7 * 24 * 3600;	
		
		ЗадачаПроверки.Записать();
		
	КонецЕсли;
	
	Если ИзменитьСтатусГЧ Тогда
		
		ИсполнительЗадачи = омЗадачи.ПолучитьИсполнителя(Перечисления.ОбъектыЗадач.РуководительЗамера);
		
		ЗадачаИзменение = Задачи.ИзменениеСтатусаГЧ.СоздатьЗадачу();
		ЗадачаИзменение.Дата 									= ТД;
		ЗадачаИзменение.Основание 								= Ссылка;
		ЗадачаИзменение.ГабаритныйЧертеж 						= ГабаритныйЧертеж;
		ЗадачаИзменение.Исполнитель 							= ИсполнительЗадачи;
		ЗадачаИзменение.Наименование							= Строка(ГабаритныйЧертеж) + ".ИзменитьСтатус";	
		ЗадачаИзменение.Проект									= Проект;	
		ЗадачаИзменение.НовыйСтатус								= НовыйСтатус;	
		ЗадачаИзменение.КрайняяДатаИсполнения					= ЗадачаИзменение.Дата + 7 * 24 * 3600;	
		
		ЗадачаИзменение.Записать();
		
	КонецЕсли;

КонецПроцедуры

Процедура ПередВыполнением(Отказ)

	ДатаПроверки 		= ТекущаяДата();
	АвторКорректировки 	= ПараметрыСеанса.ТекущийПользователь;

КонецПроцедуры

Процедура ПередИнтерактивнымВыполнением(Отказ)
	ПередВыполнением(Отказ);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	РегистрыСведений.СтатусыЗадач.НазначитьСтатусЗадачи(Ссылка);
КонецПроцедуры
